{
  "version": "https://jsonfeed.org/version/1",
  "title": "Dope-T-Rope",
  "home_page_url": "https://dopetrope.tk/",
  "feed_url": "https://dopetrope.tk/feed.json",
  "description": "Technically Dope",
  "favicon": "https://dopetrope.tk/assets/img/icons/favicon-96x96.png",
  "icon": "https://dopetrope.tk/assets/icons/apple-touch-icon-114x114.png",
  "author": {
      "name": "Sudharshan TK",
      "url": "https://dopetrope.tk/",
  },
  "expired": "false",
   "items": [
   	
    {
      "id": "24201751",
      "url": "https://dopetrope.tk/google-messages-prepares-end-to-end-encryption-for-rcs/",
      "title": "Google Messages prepares end-to-end encryption for RCS",
      "content_html": "<p>Earlier today, our friends at AndroidPolice got their hands on Google Messages 6.2.031 and uploaded it to APKMirror. Our friend Quinny899 notified us that this APK is actually a dogfood build, meaning it was not supposed to be released to the public. Sometimes, these dogfood builds have a lot of interesting code for features that are in development, and Messages 6.2.031 is definitely one of those cases. This dogfood build hints that Google is preparing end-to-end encryption for RCS messages, Google Fi account integration to sync calls, texts, and voicemails, and manual cloud restores of backups.</p>\n\n<h4 id=\"endtoend-encryption-for-rcs\">End-to-End Encryption for RCS</h4>\n\n<p>RCS is widely seen as the successor to SMS. With RCS, users can exchange media files in high quality, see read receipts, see typing indicators, start group chats, and do more over mobile data and even Wi-Fi. Rather than wait for carriers to adopt the RCS protocol on their own, Google started to roll out RCS support in the Google Messages app for everyone in the UK and France. They later rolled out RCS support in the Messages app for people in the US, Spain, Italy, Singapore, Portugal, Argentina, Pakistan, Poland, and Turkey.</p>\n\n<p>One feature that popular messaging apps like WhatsApp and Telegram support but RCS hasn’t is end-to-end encryption, but it looks like Google is preparing to add support for that on their own end. The biggest new feature that is in the works in Google Messages 6.2.031 is “End-to-End Encrypted Rich Communication Service message[s].” According to the strings, you’ll have the option to send messages with end-to-end encryption or, if your data connection is poor, without encryption by falling back to SMS/MMS.</p>\n\n<h4 id=\"google-fi-integration\">Google Fi integration</h4>\n\n<p>Another new feature that many users are looking forward to is Google Fi integration. Although Google Hangouts is on its way out, it’s still recommended to users who want to see and respond to their calls, texts, and voicemails on multiple devices. That could change soon, however, as Google Messages is preparing to pick up the slack.</p>\n\n<p>When you sign in to your Google Fi account in Google Messages, you’ll have the option to transfer conversation history from Hangouts to Messages. Unfortunately, you won’t be able to sync messages or voice calls to a computer if you enable RCS in Message. If you disable multi-device sync in settings, you’ll also be unable to access calls and voicemails on the web but you’ll continue to be able to text from the web.</p>\n\n<h4 id=\"backup-restore\">Backup &amp; Restore</h4>\n\n<p>Finally, two layout files were added hinting at a new settings page to restore messages backed up on the cloud: restore_activity_layout.xml and restore_fragment_layout.xml. The backup service in Google Play Services, as well as the backup service in Google One, can backup and restore your messages when you initially sign into a new device. It seems that Google Messages will let you choose to manually restore a previous backup of your conversations.</p>\n\n<p>You can download the latest version of the Google Messages app from the Google Play Store link below. Note, however, that the dogfood build version 6.2.031 won’t be available through Google Play and can only be downloaded through APKMirror.</p>\n",
      "summary": "End-to-End Encryption for RCS",
      "tags":  [ "Google Messages","RCS","EndtoEnd" ],
      "date_published": "2020-05-24T17:51:00+05:30"
    },

    {
      "id": "24201747",
      "url": "https://dopetrope.tk/whatsapp-beta-v2-20-171-brings-support-for-profile-qr-codes/",
      "title": "WhatsApp Beta v2.20.171 brings support for profile QR codes",
      "content_html": "<p>WhatsApp for Android operates in two public branches: stable and beta. While the stable branch is where you want to be as the average user, the beta branch gives us the opportunity to witness the features that are in development for this popular instant messaging app. Past WhatsApp Betas have shown off hints for upcoming features such as multi-device support, expiring messages, Facebook story sharing, animated stickers, and even the famed dark theme. A previous beta had also spotted hints for QR code support for profiles, and now, the latest beta brings over support for the same.</p>\n\n<p>As reported by WABetaInfo, WhatsApp for Android Beta v2.20.171 brings in support for QR codes for user profiles. This change is actually a server-side update, but you do need to be on this version to receive the feature. As one can expect, users get their own personal QR Code which they can share with other users, who can simply scan the code and add the phone number of the sharing user to their contact book. Since WhatsApp is tied to phone numbers, adding a contact number is enough to add a contact to your WhatsApp contact list.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/QR_CODE_MAIN_ANDROID-768x1536-1-e1590133845250-560x1024.jpg\" alt=\"https://www.xda-developers.com/files/2020/05/QR_CODE_MAIN_ANDROID-768x1536-1-e1590133845250-560x1024.jpg\" /></p>\n\n<p>To check out your personal QR code, you need to navigate to WhatsApp Settings and click on the QR code icon near your profile information. This opens up a new page within the app: on the first tab, you can view your own QR code, and on the second tab, you can scan QR codes from others. We also spot an image picker icon, indicating that you should also be able to scan a code from a pre-existing image in your gallery, for example, a screenshot. If needed, you can also revoke your QR code to prevent your number from being shared further.</p>\n\n<p>As mentioned, this feature is currently available in the latest release within the beta branch of WhatsApp for Android. There is no word on when the feature will be making its way to the stable branch. While QR codes are definitely handy for quickly adding a contact, you can always just share your phone number — so you aren’t losing out all that much either way.</p>\n",
      "summary": "Users get their own personal QR Code which they can share ",
      "tags":  [ "Whatsapp","QR","Profile" ],
      "date_published": "2020-05-24T17:47:00+05:30"
    },

    {
      "id": "24201727",
      "url": "https://dopetrope.tk/discord-for-android-rolls-out-noise-suppression/",
      "title": "Discord for Android rolls out noise suppression",
      "content_html": "<p>Since its debut back in 2015, Discord has evolved quite a bit and it’s now one of the most popular instant messengers for gamers and professionals alike. One of the main reasons behind Discord’s popularity is the sheer number of features it offers, both for text-based communication and VoIP calls. To provide users the best calling experience on the platform, Discord introduced a new noise suppression feature powered by Krisp for the desktop client earlier this year in April. The feature makes use of machine learning to remove background noise and, after using it for the last few weeks, I can attest that it’s actually quite fantastic. Which is why I’m excited to try it out on my phone, now that it’s rolling out to some users on the Discord app for Android.</p>\n\n<p>The noise suppression feature is already available for some users on Discord for Android version 24-alpha 1. XDA Senior Member Some_Random_Username has the feature in his app and has shared the following screenshots. As you can see, the noise suppression feature appears as a new icon in the top right corner of the app when you’re in a channel. You can tap on the icon to enable noise suppression, which will instantly drown out any background noise. Alternatively, you can toggle noise suppression for all calls from within the app’s settings and you can also enable it from within the three-dot menu on any channel.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/Discord_for_Android_24-alpha_1_Krisp_Noise_Suppression_2-512x1024.jpg\" alt=\"https://www.xda-developers.com/files/2020/05/Discord_for_Android_24-alpha_1_Krisp_Noise_Suppression_2-512x1024.jpg\" /></p>\n\n<p>Our Editor-in-Chief, Mishaal Rahman, downloaded the latest Discord release on his Pixel 4 but he didn’t find the option to enable Krisp noise suppression. I also installed the APK on my Realme 6 Pro and got the same result.</p>\n",
      "summary": "powered by Krisp",
      "tags":  [ "Discord","Noise Suppression","Krysp" ],
      "date_published": "2020-05-24T17:27:00+05:30"
    },

    {
      "id": "24201721",
      "url": "https://dopetrope.tk/google-chrome-supports-windows-hello-authentication/",
      "title": "Google Chrome supports “Windows Hello” Authentication",
      "content_html": "<p>In an attempt to streamline the payments process in Google Chrome on Windows 10, Google is now rolling out support for Windows Hello biometric authentication in the browser. The feature, which was recently spotted by a user on Twitter, will allow you to authenticate purchases on Google Chrome using Windows Hello’s fingerprint or face recognition.</p>\n\n<p>In case you own a Windows Hello capable device, you can enable the feature in Google Chrome by heading over to the Settings page in the browser and selecting Payment Methods. Here, tap on the toggle next to the Windows Hello option to enable the feature. Once the feature is enabled, Chrome will bring up a Windows Hello prompt every time you select a card to make a payment on the browser. Clicking on the Use Windows Hello button in the prompt will then allow you to enter your card’s CVC number using either facial recognition or the fingerprint scanner.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/Google-Chrome-payments-Windows-Hello.jpg\" alt=\"https://www.xda-developers.com/files/2020/05/Google-Chrome-payments-Windows-Hello.jpg\" /></p>\n\n<p>As of now, we can’t be sure when exactly Google enabled the feature in Chrome as a post on the Google Support forum suggests that it’s been around since March. It’s also worth noting that XDA Senior Member Some_Random_Username also spotted the feature in Chrome Canary v82.0.4085.4 all the way back on March 14th. The feature appears to have been enabled by a server-side update and should be available for all Google Chrome users running the latest build of the browser.</p>\n",
      "summary": " Google is now rolling out support for Windows Hello biometric authentication",
      "tags":  [ "Google Chrome","Windows Hello" ],
      "date_published": "2020-05-24T17:21:00+05:30"
    },

    {
      "id": "22200821",
      "url": "https://dopetrope.tk/instagram-makes-it-easier-to-see-when-you-re-broadcasting-music-you-can-t-use/",
      "title": "Instagram makes it easier to see when you’re broadcasting music you can’t use",
      "content_html": "<p>Instagram has posted its guidelines for using copyrighted music during live videos, Stories, and other posts on the platform, and part of the announcement includes a new update to the notification that pops up to tell users they’re using unlicensed art in ways that violate its rules. The changes to the pop-up notification are designed around helping users avoid Instagram’s automated interruptions — like muting or outright blocking — that occurs if a piece of licensed music plays for too long over or in the background of a live video.</p>\n\n<p>Now, the notification pops up earlier in live broadcasts to give users more time to remove the audio so they can avoid having the stream disrupted or taken down. Instagram will also give clearer instructions to remedy the situation in the event a stream is automatically muted or blocked due to use of unlicensed music.</p>\n\n<p><img src=\"https://cdn.vox-cdn.com/thumbor/-fwCAp2MntsoTsphyicvYfpTUaE=/0x0:604x582/920x0/filters:focal(0x0:604x582):format(webp):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19990761/instagram_notification_final.jpg\" alt=\"Instagram\" /></p>\n\n<p>“These notifications are intended to alert you when our systems detect that your broadcast or uploaded video may include music in a way that doesn’t adhere to our licensing agreements,” reads Instagram’s blog post on the changes. “Updates include making notifications clearer and surfacing notifications earlier to live broadcasters, to give people time to adjust their streams and avoid interruptions if we detect they may be approaching our limitations.”</p>\n\n<p>Instagram is also reiterating that its policy around music usage includes unlimited use in Stories and when filming live music performances and posting those to the main feed. But using music in a live video or a pre-recorded video posted to the feed has limitations, and Instagram says the general rule of thumb is to use shorter clips, to try not to use numerous clips of different music throughout a video, and to avoid making the broadcasting of music the primary focus of a video by incorporating a visual component.</p>\n\n<p>“These guidelines are consistent across live and recorded video on both Facebook and Instagram, and for all types of accounts — i.e. pages, profiles, verified and unverified accounts,” the blog post explains. “And although music is launched on our platforms in more than 90 countries, there are places where it is not yet available. So if your video includes recorded music, it may not be available for use in those locations.”</p>\n",
      "summary": "To help protect against accidental copyright infringement",
      "tags":  [ "Instagram","Copyright" ],
      "date_published": "2020-05-22T08:21:00+05:30"
    },

    {
      "id": "22200815",
      "url": "https://dopetrope.tk/twitter-brings-its-new-quote-tweet-view-to-android-and-the-web/",
      "title": "Twitter brings its new quote tweet view to Android and the web",
      "content_html": "<p>witter made it easier to see quote tweets on iOS on May 12th, and that new functionality is now available on Twitter for Android and for the web, the company announced today.</p>\n\n<p>If you tap or click on the “Retweets” word on a tweet, you’ll be taken to a new page that lets you look at one of two columns: a column showing retweets with comments and a column showing all retweets without comments. You can see how it works in the video below:</p>\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There’s now more to the conversation behind the Retweet count. On iOS, tapping into any Tweet, then tapping “Retweets” will show you the Retweets with comments. <a href=\"https://t.co/d18jK4FMvK\">https://t.co/d18jK4FMvK</a></p>&mdash; Twitter Support (@TwitterSupport) <a href=\"https://twitter.com/TwitterSupport/status/1260295359361884161?ref_src=twsrc%5Etfw\">May 12, 2020</a></blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>The new feature the latest of many that Twitter has rolled out recently to make it easier to follow and track conversations on the platform. One that I’m a particular fan of is the new interface for threaded conversations, which is available to some iOS and web users. And just yesterday, Twitter began testing a way to let users limit replies to tweets, which could help prevent abuse and harassment on the platform but does have some thorny implications for politicians’ tweets and the spreading of misleading or fake information.</p>\n",
      "summary": "The new view arrived on iOS last week",
      "tags":  [ "Twitter","new View" ],
      "date_published": "2020-05-22T08:15:00+05:30"
    },

    {
      "id": "22200813",
      "url": "https://dopetrope.tk/netflix-is-making-it-easier-for-people-to-cancel-their-subscriptions/",
      "title": "Netflix is making it easier for people to cancel their subscriptions",
      "content_html": "<p>Netflix is trying to make it easier for people to cancel their service with a new automated prompt that will ask subscribers if they want to continue paying after a lengthy period of inactivity.</p>\n\n<p>On May 18th, the company started reaching out to subscribers who haven’t used the service in two years (or within one year of their initial sign-up for newer customers) to let them know they can either keep their membership or have it canceled upon the next billing cycle. Those customers represent a small number of Netflix’s overall 183 million subscriber base, totaling less than half of 1 percent or a few hundred thousand customers. Cancelations will begin on June 1st.</p>\n\n<p>“We’ve always thought it should be easy to sign up and to cancel,” Eddy Wu, director of product innovation, wrote in a new blog post. “So, as always, anyone who cancels their account and then rejoins within 10 months will still have their favorites, profiles, viewing preferences and account details just as they left them.”</p>\n\n<p>Currently, customers have to go into their account and manually request to cancel their subscriptions. Now, if a customer falls into the aforementioned small member base, they’ll begin to see emails and in-app notifications this week, according to the blog. If they don’t confirm to the prompts that they want to remain subscribed, Netflix will automatically cancel their subscription.</p>\n",
      "summary": "Memberships can collect dust",
      "tags":  [ "Netflix Membership","subscription" ],
      "date_published": "2020-05-22T08:13:00+05:30"
    },

    {
      "id": "22200802",
      "url": "https://dopetrope.tk/microsoft-s-new-fluid-office-document-is-google-docs-on-steroids/",
      "title": "MICROSOFT’S NEW FLUID OFFICE DOCUMENT IS GOOGLE DOCS ON STEROIDS",
      "content_html": "<p>Microsoft is creating a new kind of Office document. Instead of Word, Excel, or PowerPoint, the company has created Lego blocks of Office content that live on the web. The tables, graphs, and lists that you typically find in Office documents are transforming into living, collaborative modules that exist outside of traditional documents.</p>\n\n<p>Microsoft calls its Lego blocks Fluid components, and they can be edited in real time by anyone in any app. The idea is that you could create things like a table without having to switch to multiple apps to get it done, and the table will persist on the web like a Lego block, free for anyone to use and edit.</p>\n\n<p>“Imagine you could take those Lego pieces and put them in any place you wanted: in emails, in chats, in other apps,” explains Jared Spataro, head of Microsoft 365, in an interview with The Verge. “As people work on them, they will always be updated and contain the latest information.”</p>\n\n<p>Microsoft’s Fluid Framework sounds a lot like Google Docs, but it’s actually Google Docs on steroids. Microsoft is so confident it has built the future of productivity, it’s now open-sourcing its Fluid Framework so the rest of the world can help shape what it has created. Some Office.com users will even be able to start getting an early look at this Fluid future in the coming months.</p>\n\n<p><img src=\"https://cdn.vox-cdn.com/thumbor/86fz7k0FYGIf3cAfSzODWKj_ZNI=/1200x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19983269/fluidcomponent.gif\" alt=\"Fluid Preview\" /></p>\n\n<p>At the heart of the Fluid Framework is Microsoft’s attempt to move away from the decades-old idea of creating and saving documents. Typically, you find the app that lets you create a table, chart, or list of tasks, and then you make a document, save it, and share it so people can contribute collaboratively. That’s how Google Docs works, allowing multiple people to jump in and edit a document in real time. It’s something we keep seeing in new web-based apps, and it helped make Docs a success at a time when Microsoft was still focused on dedicated desktop-focused apps.</p>\n\n<p>Microsoft is now trying to meet Office users right where they’re working on daily tasks. The idea is to be able to create these Fluid components in any app and then immediately share them without switching to a dedicated app in the first place.</p>\n\n<p>“It’s about helping people achieve a particular task,” explains Maya Rodrig, a principal program manager on Microsoft’s Fluid Framework. “It’s not about requiring them to decide ‘Which app do I go to?’ or ‘Which document do I get back to?’”</p>\n\n<p>Fluid is designed to make those tables, charts, and lists always feel alive and editable, no matter where you create them and regardless of how you share and copy them into other apps. Instead of getting a static and dull chart you copied from Excel, you’ll get a chart that can be edited anywhere you paste it, and you’ll see everyone making edits as they happen. That might be in the middle of an email chain, in a chat app like Microsoft Teams, or even third-party apps eventually.</p>\n\n<p>“Unlike a document, I like to think of a Fluid component as a little atomic unit of productivity,” says Spataro. “That Fluid component is rendered entirely in-line in an experience in which it’s embedded.” Microsoft sees Fluid as key to the future of productivity and an entirely new way to collaborate that goes beyond Google Docs or the company’s own existing Office.com work.</p>\n\n<p>Fluid is incredibly fast, too, allowing multiple people to edit a single component or an entire workspace full of Fluid components in real time. “A lot of what’s gone into Fluid is the concept of being freaky-fast,” explains Jon Friedman, corporate vice president of design and research at Microsoft. “It’s truly real time for 5, 10, 15, or 100 people to do things at the same time.”</p>\n\n<p>Microsoft is now bringing Fluid to Office.com in preview in the coming months after showing off some early examples last year. Microsoft 365 Enterprise and education subscribers will be able to create dynamic documents that multiple people can update in real time or use special Fluid components like tables, agendas, and task lists within Outlook on the web.</p>\n\n<p>Fluid components will show up with a special outline indicating they’re alive in Outlook on the web. And much like existing Office collaborative tools, you’ll see the avatars of people who are currently editing a Fluid component live and in real time within the email it’s embedded into.</p>\n\n<p>The Fluid rollout will be gradual, starting initially with Office.com and Outlook on the web, before appearing in Microsoft Teams later this year and even desktop versions of Outlook next year. The goal is to eventually build Fluid components into all Office apps like Excel, Word, and PowerPoint. At its Build developer conference this week, Microsoft is also detailing how third-party devs will be able to take advantage of Fluid in their own apps.</p>\n\n<p>“Fluid for developers is a web-based framework that you can use to instantly make your apps collaborative,” explains Spataro. “It provides data structures that perform low-latency synchronization. Those data structures connect between themselves with a relay service, and that relay service is designed to connect endpoints.” That means developers can use Fluid to replace a static string in their app, so it’s switched out into something that’s synchronized with everyone who boots up the app. Microsoft is providing more documentation and tools on how to achieve this, and the hope is that developers will embrace Fluid.</p>\n\n<p><img src=\"https://cdn.vox-cdn.com/thumbor/_FQohiZjJ_OvqP1rRAT3TGaJ38U=/0x0:5464x3072/1320x0/filters:focal(0x0:5464x3072):format(webp):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/19983262/Fluid_Framework_Outlook_web__2__1_.png\" alt=\"Fluid Preview\" /></p>\n\n<p>“The future of productivity will not be invented by a single company — not by Microsoft, not by any of our competitors. It will be invented by the world,” declares Spataro. “It is our desire to enable that future to be invented and to participate in that. We think that’s the way to go forward, and that’s the model that will work.”</p>\n\n<p>Microsoft open-sourcing Fluid Framework might have sounded surprising five years ago, but the company has been gradually adopting and embracing open-source technologies since Satya Nadella took charge back in 2014. “We do think it’s a new day. This is the world in which Microsoft is collaborating with Google on the Chromium open-source project, so we think anything is possible,” explains Spataro. “We just think that’s good for all of us. We think the innovation that happens when people work together far outweighs any of the things you give up in doing it in a closed way.”</p>\n\n<p>Microsoft has been building its Fluid Framework for around 18 months now, with approximately 140 employees now contributing to the preview. Microsoft Technical Fellow Steve Lucco, who also helped pioneer TypeScript inside the company, headed up a small team initially, with a vision of making it easier to create collaborative apps. “Steve Lucco looked at it from the fundamental level of ‘What if we built every experience on top of a data structure that was inherently distributed?’” says Dan Costenaro, a principal product manager on Microsoft’s Fluid Framework. “That’s how Fluid Framework was born initially, just a super powerful concept.”</p>\n\n<p>The basic concepts of Fluid have been used by many in preview over more than six months, and Microsoft says it has seen a big demand from third-party developers. “The interest we got was absolutely overwhelming,” explains Dan Zarzar, a partner group product manager on Microsoft’s Fluid framework. “Out of the thousands of submissions we got of people wanting to work with us, we, right now, have only been able to take eight to 15 of those partners.” Microsoft is now planning to document Fluid framework and make it open source in the coming weeks, so many more can contribute to it.</p>\n\n<p>These days, Microsoft has to compete against a sea of rivals that have created online collaborative software for a variety of solutions. It’s these separate apps and developers that Microsoft really needs to convince if it’s going to succeed in making Fluid a true new industry standard.</p>\n\n<p>Microsoft is now leaning on everyone else to help it shape Fluid because it doesn’t have all the answers for how it will ultimately evolve.</p>\n\n<p>“You can see the potential in where it’s going,” admits Spataro, “but not all the choices have yet been made.”</p>\n",
      "summary": "Fluid is coming to Office.com and going open source",
      "tags":  [ "Microsoft","Fluid","" ],
      "date_published": "2020-05-22T08:02:00+05:30"
    },

    {
      "id": "22200751",
      "url": "https://dopetrope.tk/google-play-movies-adds-its-first-dolby-vision-hdr-titles/",
      "title": "Google Play Movies adds its first Dolby Vision HDR titles",
      "content_html": "<p>Earlier this year, Google announced support for HDR content on Google Play Movies &amp; TV. The company specifically mentioned HDR10+, but we knew it was preparing to support Dolby Vision HDR as well. Today, we’re seeing a batch of Dolby Vision HDR titles available on the platform.</p>\n\n<p>Joker and A Simple Favor are the first two Dolby Vision HDR titles on Google Play Movies. It appears that Google is preparing to announce official support as there is a “Top Dolby Vision movies” section when you search for “Dolby.” Play Movies is still well behind other platforms when it comes to HDR content. Apple currently offers over 600 DV titles.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/googleplaydv_1_large-1024x576.jpg\" alt=\"https://www.xda-developers.com/files/2020/05/googleplaydv_1_large-1024x576.jpg\" /></p>\n\n<p>So what exactly is Dolby Vision and how does it compare to HDR10+? Dolby Vision is a proprietary standard for HDR, whereas HDR10+ is a royalty-free standard. Dolby Vision has a slightly higher bit depth, which measures the number of graduations of colors in an image. That slightly higher bit depth, however, makes for a huge difference in colors. Dolby Vision can display 68.7 billion colors compared to HDR10+’s 1.07 billion. Overall, DV is better than HDR10+ across the board.</p>\n\n<p>Regardless of the best standard, it’s great to see Google Play Movies finally get more HDR content. With a possible rebrand and refocusing on Android TV on the horizon, it’s important for Google’s in-house content store to offer the best quality possible. The company still has a long way to go to compete with Apple and Amazon, but you have to start somewhere.</p>\n\n",
      "summary": "Today, we’re seeing a batch of Dolby Vision HDR titles available on the platform.",
      "tags":  [ "HDR","Dolby","Google Play Movies" ],
      "date_published": "2020-05-22T07:51:00+05:30"
    },

    {
      "id": "22200744",
      "url": "https://dopetrope.tk/google-releases-assistant-powered-action-blocks/",
      "title": "Google releases Assistant-powered Action Blocks",
      "content_html": "<p>Today is Global Accessibility Awareness Day and Google is using the opportunity to announce several new accessibility-minded features. “Action Blocks” are finally ready for a public release, and new accessibility features are coming to Live Transcribe, Sound Amplifier, and Google Maps.</p>\n\n<h5 id=\"action-blocks\">Action Blocks</h5>\n\n<p>Action Blocks is a feature that Google introduced last year. In a nutshell, it’s an app that allows you to create buttons on the home screen to perform Google Assistant commands. The idea is these buttons are much easier for people with some form of cognitive disability use, rather than interacting with their voice or text.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/ActioBlocks_lightswitch.gif\" alt=\"Assistant Gif\" /></p>\n\n<p>While Action Blocks were designed as an accessibility tool, the functionality can be useful to anyone. You can create Google Assistant macros to automate things in your home and simply tap a widget instead of reciting a command. Blocks can be resized on the home screen and customized with images. Tapping a block will open Google Assistant and perform the command for you.</p>\n\n<h5 id=\"live-transcribe\">Live Transcribe</h5>\n\n<p>Next up is Live Transcribe, a tool that was introduced at Google I/O 2019. Live Transcribe automatically transcribes speech to text in multiple languages and it’s super handy. Now, Google is making it possible to add specific words that Google might not recognize, like names and things not found in the dictionary. Users can also search saved transcription by keywords.</p>\n\n<p>The most interesting new feature for Live Transcribe, however, is the ability to be notified when someone nearby says your name. Users can set their name as a keyword and their phone will vibrate when it’s heard. This could be particularly useful for people who are deaf or hearing impaired. Live Transcribe now also includes Albanian, Burmese, Estonian, Macedonian, Mongolian, Punjabi, and Uzbek.</p>\n\n<h5 id=\"sound-amplifier\">Sound Amplifier</h5>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/Keyword_Sound_Amplifier.gif\" alt=\"Amplifier\" /></p>\n\n<p>Speaking of sound, the Sound Amplifier tool (which was announced alongside Live Transcribe) now works with Bluetooth headphones. Sound Amplifier allows people to essentially increase the volume of their surroundings, and now that can be done over Bluetooth. Google Pixel devices can now boost the audio of media playing on the device as well.</p>\n\n<h5 id=\"google-maps\">Google Maps</h5>\n\n<p>Lastly, wheelchair access in Google Maps is getting more prominent placement for those that need it. The information has been available in Google Maps for a while, but it was buried inside the location details. Now, if that’s information that you need, you can select the “Accessible Places” option to have it shown right in the search results. Accessible Places is rolling out now in Australia, Japan, the United Kingdom, and the United States.</p>\n",
      "summary": "new accessibility features in Maps, Live Transcribe, and Sound Amplifier",
      "tags":  [ "Google Assistant","Action Block" ],
      "date_published": "2020-05-22T07:44:00+05:30"
    },

    {
      "id": "21201819",
      "url": "https://dopetrope.tk/microsoft-releases-terminal-1-0-and-windows-package-manager-announces-linux-gui-app-support-and-gpu-acceleration-for-wsl-2/",
      "title": "Microsoft releases Terminal 1.0 and Windows Package Manager",
      "content_html": "<p>Microsoft holds a conference event every year for software engineers and web developers. Called Build, or //build/, the event is a conference for developers that primarily work on Windows, Microsoft Azure, and other technologies. While Microsoft holds an event on the ground every year, as they have in the past years, but because of COVID-19, Build 2020 is an online-only announcement. On the occasion, Microsoft has announced a plethora of new features, such as Windows Terminal 1.0, Windows Package Manager, Windows Subsystem for Linux 2, all of which will be useful to a lot of developers in some form or the other.</p>\n\n<h4 id=\"windows-terminal-10\">Windows Terminal 1.0</h4>\n\n<p>During the last year’s Build 2019 developer conference, Microsoft had announced Windows Terminal. This is exactly what it sounds like — a new terminal app from Microsoft.</p>\n\n<iframe width=\"806\" height=\"453\" src=\"https://www.youtube.com/embed/8gw0rXPMMPE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<p>Some of the highlights of the app are the inclusion of GPU-accelerated text rendering, theming support, tabs, tear-away windows, shortcuts, full Unicode support, and more. The eventual goal of Windows Terminal is to be a good replacement to other command-line apps like PowerShell and Command Prompt.</p>\n\n<p>Windows Terminal was released as a preview at Build 2019, and now, at Build 2020, the app has graduated into its full release in the form of Windows Terminal 1.0.\nWindows Terminal 1.0 can be downloaded from the Microsoft Store or from GitHub. The app will be updated on a monthly basis starting from July 2020. But if you want to try out the latest features before they make their way to the stable branch, you can check out the preview channel on Microsoft Store and GitHub.</p>\n\n<p><strong>Key features of Windows Terminal 1.0 as mentioned in Microsoft’s documentation:</strong></p>\n\n<ol>\n  <li>Multiple profiles supporting a variety of command-line applications</li>\n  <li>Customized color schemes and configurations</li>\n  <li>Custom key bindings</li>\n  <li>Unicode and UTF-8 character support</li>\n  <li>GPU accelerated text rendering</li>\n  <li>Background image support</li>\n  <li>Support for command-line arguments</li>\n</ol>\n\n<p>Microsoft Windows Package Manager\nIf you are familiar with GNU/Linux distributions, you are very likely familiar with command-line package managers. To put it crudely, a package manager manages the process of installing, configuring, and uninstalling packages (or apps) on your computer. A command-line package manager does all of these tasks from the command line. Microsoft has never officially offered a command-line package manager, but that is now changing with the Windows Package Manager.</p>\n\n<p>Windows has had a few popular third-party command-line package managers, like Chocolatey — but these are unofficial and not from Microsoft themselves. Unlike an app store like the Windows Store, a package manager supports installing apps from multiple sources, which makes it easy to set up different development environments with fewer friction points.</p>\n\n<p>Windows Package Manager is now available in preview form. What’s even more exciting about this is the fact that it is open source.</p>\n\n<p>Windows Package Manager offers the following features, when preceded with the winget command:</p>\n\n<ol>\n  <li>install – Installs the given application</li>\n  <li>show – Shows info about an application</li>\n  <li>source – Manage sources of applications</li>\n  <li>search – Find and show basic info of apps</li>\n  <li>hash – Helper to hash installer files</li>\n  <li>validate – Validates a manifest file</li>\n  <li>–help – Provides command line help</li>\n  <li>–info – Provides addition data, helpful for troubleshooting</li>\n  <li>–version – Provides the version of the client</li>\n</ol>\n\n<p>To explain, if you use “winget install“, you’ll see all the command-line options to interface with Windows Package Manager. For example, if you type “winget install terminal” you’ll install the new Windows Terminal software. Windows Package Manager is pre-configured to point to the Microsoft community repository and you can search for available packages using “winget search” and display information using “winget show“. You’ll be able to add third-party repositories with “winget source” as well.</p>\n\n<p>The command-line client is distributed within the App Installer package that is pre-installed on Windows. However, the client will not be made generally available during the Preview period, so you must either install a Windows 10 Insider build or sign up for the preview flight ring to receive automatic updates. Further, if you do not mind foregoing the automatic updates, you can also manually install it on any Windows 10 version since the Fall Creators Update (1709). When Windows Package Manager reaches version 1.0, it will be delivered with the Desktop App Installer.</p>\n\n<p>**Windows Subsystem for Linux 2 / WSL 2 **</p>\n\n<p>At Build 2019, Microsoft had announced Windows Subsystem for Linux 2, which ships a full Linux kernel, allowing you to run Linux commands and apps. For instance, you can even go ahead and compile LineageOS using WSL on Windows.</p>\n\n<p>**Now, Microsoft has announced multiple major changes to the WSL:\n**</p>\n\n<ol>\n  <li>Added support for graphics processing unit (GPU) compute workflows 2. allows Linux tools to leverage GPUs to enable hardware acceleration for many development scenarios, such as parallel computation and training machine learning (ML) and artificial intelligence (AI) models.</li>\n  <li>Support for Linux graphical user interface (GUI) apps will enable you to open a WSL instance and run a Linux GUI app directly without the need for a third-party X server. This will help you to run your favorite apps in a Linux environment such as an integrated development environment (IDE).</li>\n</ol>\n\n<p>WSL will soon support a simplified install experience by running the command ‘wsl.exe – install,’ which will make it easier than ever to start using Linux apps on Windows.</p>\n\n<p>With these upcoming changes to WSL 2, users no longer need to run an X server to use Linux apps with GUIs. Linux apps will also now run much more seamlessly on Windows. As Mishaal points out, this might just be the tipping point for the “year of the Linux desktop” meme to finally come true, and it’s ironic that it is Microsoft that is bringing this around.</p>\n",
      "summary": "Microsoft had announced Windows Terminal.",
      "tags":  [ "Windows Terminal","linux gui","wsl 2" ],
      "date_published": "2020-05-21T18:19:00+05:30"
    },

    {
      "id": "21201811",
      "url": "https://dopetrope.tk/digital-wellbeing-prepares-to-track-your-sleep-let-you-take-night-notes-and-more/",
      "title": "Digital Wellbeing prepares to track your sleep, let you take Night Notes, and more",
      "content_html": "<p>oogle first unveiled Digital Wellbeing at Google I/O 2018 with a handful of tools to help users reduce their smartphone usage, but the company has steadily improved upon the app in the last 2 years by introducing loads of new features. In the latest beta update to version 1.0.312292882, Google is preparing to introduce major new features to help you get a better night’s sleep.</p>\n\n<h6 id=\"new-daily-device-usage-toggle-in-manage-your-data\">New “Daily Device Usage” toggle in “Manage Your Data”</h6>\n\n<p>The first feature that Google is introducing is already available for everyone on the latest beta release. If you open the settings menu in Digital Wellbeing, you’ll see a new “Manage your data” option that brings you to a new activity with a toggle for “daily device usage.” This option will let you decide if Digital Wellbeing should track your device unlocks, notifications received, and app usage. Disabling this option turns off usage access, so Digital Wellbeing can’t track your phone use anymore.</p>\n\n<p>Currently, this toggle is the only one available in “Manage your data.” However, it will soon be joined by other options. Currently, this toggle is the only one available in “Manage your data.” However, it will soon be joined by other options.</p>\n\n<h4 id=\"sleep-habit-tracking\">Sleep Habit Tracking</h4>\n\n<p>The biggest new feature in the works is sleep habit tracking. We managed to surface a new activity that lets the user grant Digital Wellbeing and the Google Clock apps access to daily app usage, motion and light sensor data during your scheduled bedtimes, and time zone history. Granting these two apps access to that data will let both apps “show you a snapshot of your sleep habits.”</p>\n\n<p>The strings from within the APK tell us what kind of insights Digital Wellbeing will be able to offer on sleep. In summary, Digital Wellbeing can tell you how long you spent in bed, how long you were on your phone while in bed (and how long you spent without it), and when your bedtime started and ended.</p>\n",
      "summary": "New “Daily Device Usage” toggle in “Manage Your Data”",
      "tags":  [ "android","digital-wellBeing" ],
      "date_published": "2020-05-21T18:11:00+05:30"
    },

    {
      "id": "21201804",
      "url": "https://dopetrope.tk/youtube-music-player-page-adds-a-related-tab-for-recommended-songs-and-playlists/",
      "title": "YouTube Music player page adds a “Related” tab for recommended songs and playlists",
      "content_html": "<p>Earlier this year in March, Google rolled out a redesigned player page for YouTube Music on Android. The updated UI included a new tab for static lyrics at the bottom of the music player, alongside the Up Next tab which lists all songs in the current playlist. Now, according to a couple of recent posts on Reddit, YouTube Music is getting a new “Related” tab in the same position on the player page.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/YouTube-Music-Related-tab-975x1024.jpg\" alt=\"Youtube Music\" /></p>\n\n<p>As its name suggests, the Related tab lists down recommended songs and playlists based on whatever you’re currently listening to. As you can see in the screenshot above, the tab includes a section called You might also like, which lists similar songs, and a Recommended playlists section, which lists similar playlists. However, another screenshot of the Related tab suggests that it will also show similar artists and other songs from the artist that you’re currently listening to. This leads us to believe that Google hasn’t finalized the design yet and might make some further changes to the tab before it’s released to more users.</p>\n\n<p><img src=\"https://www.xda-developers.com/files/2020/05/YouTube-Music-Related-tab-2-576x1024.jpg\" alt=\"Music\" /></p>\n\n<p>At the moment, it isn’t clear whether the new Related tab has been added to the YouTube Music app as part of the latest update or if it has been enabled by a server-side switch. The feature is currently only available to a handful of users and we have no information from Google regarding a broader rollout. We’ll update this post as soon as we learn more from the company.</p>\n",
      "summary": "Related tab lists down recommended songs and playlists based on whatever you’re currently listening to",
      "tags":  [ "Youtube","music","recommendation" ],
      "date_published": "2020-05-21T18:04:00+05:30"
    },

    {
      "id": "21201745",
      "url": "https://dopetrope.tk/blog-is-live-after-months-of-rebuilding/",
      "title": "Blog is Live After Months of Rebuilding",
      "content_html": "<h5 id=\"hey-there-this-is-shan-from-dopetrope\">Hey there, This is Shan from <em>Dopetrope</em>.</h5>\n\n<p>This Website has Been Upgraded with Massive Features in the Backend for Faster Loading of Website with Some Cool Asynchronous Programming.</p>\n\n<p>Now Has a Faster CDN for Images and Videos Posted Here.</p>\n\n<p>Everything in this Website has Been Completely Automated.\nOur Website now Has its Own API for Interaction with Multiple Web / Android Apps.</p>\n\n<p>Therefore in Future, You May be Able to use this as a Android App.\nEverything is Possible with the help of the API that is Constructed in the Backend.</p>\n\n<h4 id=\"enjoy-faster-content-posts\">Enjoy Faster Content / Posts</h4>\n<h5 id=\"from-shantksudharshan-tk\">from Shan.tk(Sudharshan TK)</h5>\n\n",
      "summary": "Promise you to keep this Blog constantly Updated",
      "tags":  [ "live","dopetrope","technology" ],
      "date_published": "2020-05-21T17:45:00+05:30"
    },

    {
      "id": "23190340",
      "url": "https://dopetrope.tk/Welcome-v2/",
      "title": "Welcome to Read Write Tech V2.0 (Now Dope-T-Rope)",
      "content_html": "<h4 id=\"read-write-tech-is-now-dope-t-rope---dopetech\">Read Write Tech is Now Dope-T-Rope - #DopeTech</h4>\n\n<p>See the <a href=\"https://dopetrope.tk/\">Website Here</a>.</p>\n\n<h5 id=\"what-is-it\">What is it?</h5>\n\n<p>Dope-T-Rope is a Personal Tech Blog / News Website that Gets You Updated with Latest Techno News.</p>\n\n<h5 id=\"features\">Features</h5>\n\n<ul>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#live-search\">Live Search</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#estimated-reading-time\">Estimated Reading Time</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#reading-progress-bar\">Reading Progress Bar</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#new-post-tag\">“New Post” tag</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#load-images-on-demand\">Load images on demand</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#push-menu\">Push Menu</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#svg-icons\">SVG icons</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#shell-script-to-create-posts\">Shell script to create posts</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#tags-page\">Tags page</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#about-page\">About page</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#contact-page\">Contact page</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#404-error-page\">404 error page</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#feed-rss\">Feed RSS</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#disqus\">Disqus</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#featured-post\">Featured post</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#home-page-pagination\">Home page pagination</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#posts-sidebar\">Posts sidebar</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#paginated-posts\">Paginated posts</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#before-you-go-modal\">“Before you go” modal</a> <em>(optional)</em></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#post-recommendation\">Post recommendation</a></li>\n  <li><a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#netlify-cms-ready\">Netlify CMS ready</a></li>\n</ul>\n\n<h5 id=\"seo\">SEO</h5>\n\n<ul>\n  <li>Google Analytics</li>\n  <li>Meta tags</li>\n  <li>JSON-LD</li>\n  <li>Sitemap.xml</li>\n  <li>Social Media ready</li>\n</ul>\n\n<h5 id=\"release-notes\">Release notes</h5>\n<h6 id=\"v200\">v2.0.0</h6>\n\n<ul>\n  <li>Completely Published as a npm Package</li>\n  <li>Added optional <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/Features#posts-sidebar\">sidebar</a></li>\n  <li>Added optional <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#featured-post\">Featured post</a></li>\n  <li>Added optional <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#before-you-go-modal\">“Before you go” modal</a></li>\n  <li>Added optional <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#paginated-posts\">post pagination</a></li>\n  <li>Added <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#post-recommendation\">post recommendation</a></li>\n  <li>Added meta keywords to improve SEO</li>\n  <li>Added JSON-LD to improve SEO</li>\n  <li>Changed pagination to be <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#home-page-pagination\">optional</a></li>\n  <li>Improved <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#tags-page\">Tags page</a></li>\n  <li>Cleaned up and improved <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/post#front-matter-properties\">Front Matter properties</a></li>\n  <li>Set up <a href=\"https://github.com/thiagorossener/jekflix-template/wiki/features#netlify-cms-ready\">Netlify CMS</a></li>\n  <li>Improved customization settings</li>\n  <li>Minor design updates</li>\n</ul>\n",
      "summary": "Website's Upgraded with Nice Cool New Features",
      "tags":  [ "V2.0","dynamic","Cool" ],
      "date_published": "2020-11-23T03:40:00+05:30"
    }

  ]
}